[
  {
    "chapter": 1,
    "quiz": [
      {
        "question": "Which deployment model combines public cloud, private cloud, and on-premises infrastructure?",
        "answerOptions": [
          {
            "text": "Public Cloud",
            "isCorrect": false,
            "rationale": "Public cloud resources are owned and operated by a third-party provider and shared across multiple organizations."
          },
          {
            "text": "Community Cloud",
            "isCorrect": false,
            "rationale": "Community cloud is shared by several organizations with common concerns, not necessarily a mix of public and private."
          },
          {
            "text": "Hybrid Cloud",
            "isCorrect": true,
            "rationale": "Hybrid Cloud explicitly connects public and private clouds (including on-premises), allowing data and applications to be shared between them."
          },
          {
            "text": "Federated Cloud",
            "isCorrect": false,
            "rationale": "Federated cloud refers to the amalgamation of multiple cloud providers, but 'Hybrid' is the standard term for the specific mix of public/private/on-prem."
          }
        ],
        "hint": "Think of a model that bridges internal data centers with external providers to allow for 'bursting'."
      },
      {
        "chapter": 1,
        "question": "What is 'Cloud Bursting' in the context of a Hybrid Cloud?",
        "answerOptions": [
          {
            "text": "A security breach in the cloud",
            "isCorrect": false,
            "rationale": "This describes a vulnerability or attack, not a deployment strategy."
          },
          {
            "text": "The process of deleting data to save space",
            "isCorrect": false,
            "rationale": "Deleting data is part of storage management or lifecycle policies, unrelated to 'bursting'."
          },
          {
            "text": "Scaling workloads from a private cloud to a public cloud during demand spikes",
            "isCorrect": true,
            "rationale": "Cloud bursting allows an application to run in a private cloud and 'burst' into a public cloud only when demand increases."
          },
          {
            "text": "Moving all operations permanently to the public cloud",
            "isCorrect": false,
            "rationale": "This is a migration strategy, whereas bursting is a temporary, dynamic scaling technique."
          }
        ],
        "hint": "Consider what happens when a private container overflows; where does the excess go?"
      },
      {
        "question": "In which service model does the customer manage operating systems, applications, and data?",
        "answerOptions": [
          {
            "text": "SaaS",
            "isCorrect": false,
            "rationale": "In SaaS, the provider manages everything including the application and OS."
          },
          {
            "text": "PaaS",
            "isCorrect": false,
            "rationale": "In PaaS, the provider manages the OS and runtime; the customer manages applications and data."
          },
          {
            "text": "IaaS",
            "isCorrect": true,
            "rationale": "IaaS provides raw computing resources. The customer is responsible for the OS, middleware, runtime, data, and applications."
          },
          {
            "text": "FaaS",
            "isCorrect": false,
            "rationale": "In FaaS (Serverless), the provider manages the infrastructure and OS entirely; the user only provides code."
          }
        ],
        "hint": "Which model offers the most control, similar to managing a virtual machine in a traditional data center?"
      },
      {
        "question": "What distinguishes elasticity from scalability in cloud computing?",
        "answerOptions": [
          {
            "text": "Elasticity is manual; scalability is automatic",
            "isCorrect": false,
            "rationale": "Both can be automated; the distinction lies in the direction and responsiveness of the resource change."
          },
          {
            "text": "Elasticity dynamically adjusts resources; scalability handles growing workloads",
            "isCorrect": true,
            "rationale": "Scalability is the ability to handle growth (often by adding resources), while elasticity is the ability to shrink and grow dynamically to match current demand."
          },
          {
            "text": "They are the same concept",
            "isCorrect": false,
            "rationale": "They are related but distinct: Scalability is about capacity for growth; Elasticity is about efficiency and matching supply to demand."
          },
          {
            "text": "Elasticity only applies to storage",
            "isCorrect": false,
            "rationale": "Elasticity applies to compute, memory, and storage resources equally."
          }
        ],
        "hint": "One concept implies a permanent increase to handle growth; the other implies a rubber-band-like ability to stretch and snap back."
      },
      {
        "question": "Which computing paradigm is the direct precursor to cloud's pay-per-use billing model?",
        "answerOptions": [
          {
            "text": "Grid Computing",
            "isCorrect": false,
            "rationale": "Grid computing focused on aggregating resources for large tasks, not specifically on the metered billing model."
          },
          {
            "text": "Cluster Computing",
            "isCorrect": false,
            "rationale": "Cluster computing connects tightly coupled computers to work as a single unit, usually without a public pay-per-use model."
          },
          {
            "text": "Utility Computing",
            "isCorrect": true,
            "rationale": "Utility computing introduced the concept of offering computing resources as a metered service, similar to electricity or water."
          },
          {
            "text": "Parallel Computing",
            "isCorrect": false,
            "rationale": "Parallel computing is a method of computation, not a business or delivery model."
          }
        ],
        "hint": "Think of how you pay for water and electricity at home."
      },
      {
        "question": "According to Amdahl's Law, if 10% of a program is sequential (α = 0.10), what is the maximum theoretical speedup achievable with infinite processors?",
        "answerOptions": [
          {
            "text": "5×",
            "isCorrect": false,
            "rationale": "5× would imply 20% sequential code (1/0.20)."
          },
          {
            "text": "10×",
            "isCorrect": true,
            "rationale": "Amdahl's Law states Speedup = 1/α. With α=0.10, the max speedup is 1/0.10 = 10, regardless of processor count."
          },
          {
            "text": "20×",
            "isCorrect": false,
            "rationale": "20× would require the sequential portion to be only 5%."
          },
          {
            "text": "100×",
            "isCorrect": false,
            "rationale": "100× would require the sequential portion to be only 1%."
          }
        ],
        "hint": "The speedup is limited by the part of the task that cannot be parallelized. Divide 1 by the decimal percentage of that sequential part."
      },
       {
        "question": "What is the primary goal of Green Computing?",
        "answerOptions": [
            {
                "text": "To increase the processing power of supercomputers",
                "isCorrect": false,
                "rationale": "Increasing power often contradicts green goals unless efficiency is also improved."
            },
            {
                "text": "To reduce energy consumption, carbon emissions, and electronic waste",
                "isCorrect": true,
                "rationale": "Green computing focuses on environmentally sustainable practices in the design, manufacture, use, and disposal of computers."
            },
            {
                "text": "To exclusively use solar power for data centers",
                "isCorrect": false,
                "rationale": "While renewable energy is part of it, Green Computing is broader and includes reducing e-waste and improving hardware efficiency."
            },
            {
                "text": "To create biodegradable computer hardware",
                "isCorrect": false,
                "rationale": "This is a potential method, but not the overarching primary goal which encompasses energy and lifecycle management."
            }
        ],
        "hint": "Think about the environmental impact of technology, specifically regarding energy and waste."
      }
    ]
  },
  {
    "chapter": 2,
    "quiz": [
      {
        "question": "In the 'Trap and Emulate' mechanism, where does the Guest OS run?",
        "answerOptions": [
          {
            "text": "Kernel mode",
            "isCorrect": false,
            "rationale": "The Guest OS thinks it is in kernel mode, but the Hypervisor prevents this to maintain control."
          },
          {
            "text": "User mode",
            "isCorrect": true,
            "rationale": "The Guest OS runs in user mode with restricted privileges. When it tries to execute privileged instructions, it 'traps' to the Hypervisor."
          },
          {
            "text": "Hypervisor mode",
            "isCorrect": false,
            "rationale": "Only the Hypervisor (VMM) runs in this privileged mode."
          },
          {
            "text": "Ring 0",
            "isCorrect": false,
            "rationale": "Ring 0 is typically reserved for the host kernel or hypervisor; the Guest OS is deprivileged."
          }
        ],
        "hint": "The Guest OS must be prevented from executing sensitive hardware instructions directly, so it runs in a restricted ring."
      },
      {
        "question": "Which hypervisor type runs directly on hardware without a host OS?",
        "answerOptions": [
          {
            "text": "Type 2 Hypervisor",
            "isCorrect": false,
            "rationale": "Type 2 hypervisors run as software applications on top of a standard operating system."
          },
          {
            "text": "Hosted Hypervisor",
            "isCorrect": false,
            "rationale": "Hosted is another name for Type 2; it relies on a host OS."
          },
          {
            "text": "Type 1 Hypervisor",
            "isCorrect": true,
            "rationale": "Type 1 (Bare Metal) hypervisors install directly on the server hardware for maximum efficiency."
          },
          {
            "text": "Container Runtime",
            "isCorrect": false,
            "rationale": "Container runtimes rely on a host OS kernel and are not hypervisors."
          }
        ],
        "hint": "Think 'Bare Metal'—it doesn't need Windows or Linux underneath it."
      },
      {
        "question": "What is the primary purpose of Domain 0 in Xen architecture?",
        "answerOptions": [
          {
            "text": "Run unprivileged guest VMs",
            "isCorrect": false,
            "rationale": "Unprivileged guests are called Domain U (DomU)."
          },
          {
            "text": "Manage hardware resources and allocate them to guest domains",
            "isCorrect": true,
            "rationale": "Dom0 is a privileged VM that boots first and houses the drivers and toolstack to manage all other VMs."
          },
          {
            "text": "Provide network isolation",
            "isCorrect": false,
            "rationale": "While it helps configure networking, its primary role is management and hardware abstraction."
          },
          {
            "text": "Handle encryption",
            "isCorrect": false,
            "rationale": "Encryption is a function that can happen anywhere, not the defining purpose of Dom0."
          }
        ],
        "hint": "In Xen, one special domain acts as the administrator for all others."
      },
      {
        "question": "Which storage type is accessed through APIs rather than a file system?",
        "answerOptions": [
          {
            "text": "Volume Storage",
            "isCorrect": false,
            "rationale": "Volume (Block) storage is accessed by the OS as a mounted disk drive."
          },
          {
            "text": "File Storage",
            "isCorrect": false,
            "rationale": "File storage (like NFS) is accessed via network file system protocols and directory trees."
          },
          {
            "text": "Object Storage",
            "isCorrect": true,
            "rationale": "Object storage (e.g., S3) uses HTTP APIs (GET, PUT, DELETE) to manage data as flat objects with metadata."
          },
          {
            "text": "Block Storage",
            "isCorrect": false,
            "rationale": "Block storage is accessed at the sector/block level by the OS, not via web APIs."
          }
        ],
        "hint": "This storage type is popular for cloud apps because you can access data via a URL, like Amazon S3."
      },
      {
        "question": "What is the main security benefit of the NoHype architecture?",
        "answerOptions": [
          {
            "text": "Better performance",
            "isCorrect": false,
            "rationale": "Performance is a benefit, but the question asks for the *security* benefit."
          },
          {
            "text": "Eliminates hypervisor as attack surface",
            "isCorrect": true,
            "rationale": "NoHype removes the hypervisor layer after boot, preventing VM escape attacks and reducing the attack surface."
          },
          {
            "text": "Easier resource management",
            "isCorrect": false,
            "rationale": "NoHype actually makes management harder because the virtualization layer is removed."
          },
          {
            "text": "Lower cost",
            "isCorrect": false,
            "rationale": "Cost is not the primary driver for NoHype; security isolation is."
          }
        ],
        "hint": "If the Hypervisor is the target of attacks, what does this architecture do to it?"
      },
      {
        "question": "In data dispersion, how many fragments must be retrieved to reconstruct a file if it was split into n fragments?",
        "answerOptions": [
          {
            "text": "All n fragments",
            "isCorrect": false,
            "rationale": "If all n were required, losing one would lose data, offering no redundancy."
          },
          {
            "text": "m fragments where m < n",
            "isCorrect": true,
            "rationale": "Data dispersion (like Erasure Coding) allows reconstruction from a subset 'm' of the total 'n' fragments."
          },
          {
            "text": "n/2 fragments",
            "isCorrect": false,
            "rationale": "While n/2 is a possible value for m, the rule is simply that m is a sufficient subset, not necessarily exactly half."
          },
          {
            "text": "Exactly 3 fragments",
            "isCorrect": false,
            "rationale": "3 is a specific implementation detail, not the general rule for dispersion."
          }
        ],
        "hint": "This technique works like a hologram or RAID; you don't need every single piece to see the whole picture."
      }
    ]
  },
  {
    "chapter": 3,
    "quiz": [
      {
        "question": "What is the key difference between Docker images and containers?",
        "answerOptions": [
          {
            "text": "Images are dynamic; containers are static",
            "isCorrect": false,
            "rationale": "This is reversed. Images are the static templates."
          },
          {
            "text": "Images are read-only templates; containers are running instances",
            "isCorrect": true,
            "rationale": "An image is the build artifact (code + libs). A container is the execution of that image with a writable layer."
          },
          {
            "text": "They are the same thing",
            "isCorrect": false,
            "rationale": "They are related but distinct states (stored vs. running)."
          },
          {
            "text": "Containers are stored on disk; images run in memory",
            "isCorrect": false,
            "rationale": "Images are stored on disk; containers run in memory (though they also exist on disk)."
          }
        ],
        "hint": "Think of the relationship between a Class (code) and an Object (instance) in programming."
      },
      {
        "question": "What happens to data in Docker's container layer when the container is deleted?",
        "answerOptions": [
          {
            "text": "It's saved to the image",
            "isCorrect": false,
            "rationale": "Images are immutable and read-only; they are never updated by container changes."
          },
          {
            "text": "It's permanently lost",
            "isCorrect": true,
            "rationale": "The container's top read/write layer is ephemeral and tied to the container's lifecycle. Deleting the container deletes this layer."
          },
          {
            "text": "It's backed up automatically",
            "isCorrect": false,
            "rationale": "Docker does not backup data automatically; you must use Volumes for persistence."
          },
          {
            "text": "It's moved to a volume",
            "isCorrect": false,
            "rationale": "Data is only stored in a volume if explicitly configured; otherwise, it stays in the ephemeral layer."
          }
        ],
        "hint": "Unless you use a 'Volume', the writable part of a container is ephemeral."
      },
      {
        "question": "What does the EXPOSE instruction in a Dockerfile specify?",
        "answerOptions": [
          {
            "text": "The port the container will listen on",
            "isCorrect": true,
            "rationale": "EXPOSE documents that the container listens on specific network ports at runtime."
          },
          {
            "text": "The network interface to use",
            "isCorrect": false,
            "rationale": "Interface selection is handled by the Docker daemon/network drivers, not the Dockerfile."
          },
          {
            "text": "The firewall rules",
            "isCorrect": false,
            "rationale": "EXPOSE does not create firewall rules or publish the port to the host; it is metadata."
          },
          {
            "text": "The load balancer configuration",
            "isCorrect": false,
            "rationale": "Load balancing is an orchestration concern, not part of the Dockerfile image definition."
          }
        ],
        "hint": "It serves as documentation for which network port the app uses, but it doesn't actually open it to the outside world."
      },
      {
        "question": "What is Docker Compose primarily used for?",
        "answerOptions": [
          {
            "text": "Building single container images",
            "isCorrect": false,
            "rationale": "Standard `docker build` handles single images."
          },
          {
            "text": "Managing and running multiple containers as a single application",
            "isCorrect": true,
            "rationale": "Docker Compose allows defining multiple services (database, web, cache) in one YAML file and running them together."
          },
          {
            "text": "Deploying to production only",
            "isCorrect": false,
            "rationale": "Compose is widely used for local development and testing, not just production."
          },
          {
            "text": "Creating Dockerfiles",
            "isCorrect": false,
            "rationale": "Compose uses Dockerfiles; it does not create them."
          }
        ],
        "hint": "If your app needs a web server AND a database to work, you use this tool to start them both at once."
      },
      {
        "question": "Which command is used to create a Docker image from a Dockerfile?",
        "answerOptions": [
          {
            "text": "docker run",
            "isCorrect": false,
            "rationale": "`docker run` creates a container from an existing image."
          },
          {
            "text": "docker build",
            "isCorrect": true,
            "rationale": "`docker build` reads the Dockerfile instructions and constructs a new image."
          },
          {
            "text": "docker create",
            "isCorrect": false,
            "rationale": "`docker create` initializes a container but does not start it; it does not build images."
          },
          {
            "text": "docker commit",
            "isCorrect": false,
            "rationale": "`docker commit` creates an image from a running container's changes, not from a Dockerfile."
          }
        ],
        "hint": "You are 'building' the blueprint."
      },
      {
        "question": "Which flag is used with the 'docker run' command to map a host port to a container port?",
        "answerOptions": [
          {
            "text": "-v",
            "isCorrect": false,
            "rationale": "The `-v` flag is used to mount volumes."
          },
          {
            "text": "-d",
            "isCorrect": false,
            "rationale": "The `-d` flag runs the container in detached (background) mode."
          },
          {
            "text": "-p",
            "isCorrect": true,
            "rationale": "The `-p` (publish) flag maps a port on the host to a port inside the container (e.g., -p 8080:80)."
          },
          {
            "text": "-it",
            "isCorrect": false,
            "rationale": "The `-it` flag allows for interactive terminal access."
          }
        ],
        "hint": "Think 'P' for Port."
      },
      {
        "question": "What is the primary difference between vertical and horizontal scaling?",
        "answerOptions": [
          {
            "text": "Vertical adds more servers; horizontal increases server resources",
            "isCorrect": false,
            "rationale": "This is the reverse of the correct definition."
          },
          {
            "text": "Vertical increases server resources; horizontal adds more servers",
            "isCorrect": true,
            "rationale": "Vertical (Scale Up) = bigger CPU/RAM. Horizontal (Scale Out) = more machines."
          },
          {
            "text": "They are the same",
            "isCorrect": false,
            "rationale": "They represent fundamentally different approaches to handling load."
          },
          {
            "text": "Vertical is cheaper than horizontal",
            "isCorrect": false,
            "rationale": "Vertical scaling gets exponentially expensive at the high end, whereas horizontal uses commodity hardware."
          }
        ],
        "hint": "Think of a building: you can add more floors (Vertical) or build a second building next to it (Horizontal)."
      },
      {
        "question": "Which load balancing algorithm routes traffic to the server with the fewest active connections?",
        "answerOptions": [
          {
            "text": "Round Robin",
            "isCorrect": false,
            "rationale": "Round Robin cycles through servers sequentially, regardless of load."
          },
          {
            "text": "Least Connections",
            "isCorrect": true,
            "rationale": "This algorithm is dynamic; it checks which server is currently handling the least work and sends the new request there."
          },
          {
            "text": "IP Hash",
            "isCorrect": false,
            "rationale": "IP Hash routes based on the client's IP address to ensure stickiness."
          },
          {
            "text": "Weighted Round Robin",
            "isCorrect": false,
            "rationale": "Weighted Round Robin accounts for server capacity but follows a set rotation, not active connections."
          }
        ],
        "hint": "The name of the algorithm literally describes the criteria it uses."
      }
    ]
  },
  {
    "chapter": 4,
    "quiz": [
      {
        "question": "In multi-tenancy architecture, what is the 'noisy neighbor' problem?",
        "answerOptions": [
          {
            "text": "Network routing issues",
            "isCorrect": false,
            "rationale": "While network issues can occur, noisy neighbor specifically refers to resource contention."
          },
          {
            "text": "One tenant using excessive resources slows performance for others",
            "isCorrect": true,
            "rationale": "Since tenants share infrastructure (CPU/IO), a heavy workload from one can starve the others of resources."
          },
          {
            "text": "Database corruption",
            "isCorrect": false,
            "rationale": "Corruption is a data integrity issue, not a performance contention issue."
          },
          {
            "text": "Security breach",
            "isCorrect": false,
            "rationale": "Noisy neighbor is about performance isolation, not necessarily data access or security."
          }
        ],
        "hint": "Imagine living in an apartment where the person next door plays loud drums all night."
      },
      {
        "question": "Which multi-tenancy architecture provides the highest isolation?",
        "answerOptions": [
          {
            "text": "Shared Application + Shared Database",
            "isCorrect": false,
            "rationale": "This offers the lowest isolation as everyone's data is commingled in the same tables."
          },
          {
            "text": "Shared Application + Separate Database",
            "isCorrect": false,
            "rationale": "This is a middle ground; data is isolated, but the application runtime is still shared."
          },
          {
            "text": "Separate Application + Separate Database",
            "isCorrect": true,
            "rationale": "Each tenant gets their own app instance and database. It acts like a private cloud within a SaaS, offering maximum security."
          },
          {
            "text": "All provide equal isolation",
            "isCorrect": false,
            "rationale": "Isolation levels vary significantly based on how much infrastructure is shared."
          }
        ],
        "hint": "The option where tenants share absolutely nothing."
      },
      {
        "question": "What is the main purpose of Service Oriented Architecture (SOA) in SaaS?",
        "answerOptions": [
          {
            "text": "To increase server capacity",
            "isCorrect": false,
            "rationale": "SOA is a software design pattern, not a hardware scaling strategy."
          },
          {
            "text": "To break applications into independent, reusable services",
            "isCorrect": true,
            "rationale": "SOA structures software as distinct services that communicate over a network, promoting reusability and modularity."
          },
          {
            "text": "To reduce network latency",
            "isCorrect": false,
            "rationale": "SOA often *increases* latency due to network calls between services compared to a monolith."
          },
          {
            "text": "To eliminate databases",
            "isCorrect": false,
            "rationale": "SOA services still need data storage; they do not eliminate it."
          }
        ],
        "hint": "Instead of one giant block of code, the app is built from many small, talking blocks."
      },
      {
        "question": "What are webhooks in SaaS integration?",
        "answerOptions": [
          {
            "text": "Database queries",
            "isCorrect": false,
            "rationale": "Webhooks are triggered by events, whereas queries are requests for data."
          },
          {
            "text": "Event-driven push notifications from one app to another",
            "isCorrect": true,
            "rationale": "Webhooks allow App A to 'call' App B automatically when something happens (e.g., 'Payment Received'), pushing data in real-time."
          },
          {
            "text": "User interface components",
            "isCorrect": false,
            "rationale": "Webhooks are backend communication tools, not UI elements."
          },
          {
            "text": "Encryption methods",
            "isCorrect": false,
            "rationale": "Webhooks are a transport mechanism, not a cryptographic algorithm."
          }
        ],
        "hint": "Don't call us, we'll call you. (Push vs Pull)."
      },
      {
        "question": "Which API type uses XML and strict contracts for enterprise systems?",
        "answerOptions": [
          {
            "text": "REST API",
            "isCorrect": false,
            "rationale": "REST is flexible, typically uses JSON, and is less strict than SOAP."
          },
          {
            "text": "SOAP API",
            "isCorrect": true,
            "rationale": "SOAP (Simple Object Access Protocol) is a protocol with strict standards, using XML for messaging, often preferred in legacy enterprise/banking."
          },
          {
            "text": "GraphQL",
            "isCorrect": false,
            "rationale": "GraphQL is a query language for APIs that allows clients to request exactly what they need, usually in JSON."
          },
          {
            "text": "Webhooks",
            "isCorrect": false,
            "rationale": "Webhooks are a pattern for event notification, not a specific protocol format like XML/SOAP."
          }
        ],
        "hint": "Think of the older, heavyweight protocol often used in banking."
      }
    ]
  },
  {
    "chapter": 5,
    "quiz": [
      {
        "question": "What is the main advantage of microservices over monolithic architecture?",
        "answerOptions": [
          {
            "text": "Simpler deployment",
            "isCorrect": false,
            "rationale": "Microservices deployment is complex due to the number of moving parts."
          },
          {
            "text": "Independent scaling and fault isolation",
            "isCorrect": true,
            "rationale": "You can scale just the 'Login' service if it's busy, and if 'Search' crashes, the rest of the app stays up."
          },
          {
            "text": "Requires less network bandwidth",
            "isCorrect": false,
            "rationale": "Microservices require *more* bandwidth because components talk over the network."
          },
          {
            "text": "Easier to debug",
            "isCorrect": false,
            "rationale": "Debugging distributed systems is generally harder than tracing a single monolithic process."
          }
        ],
        "hint": "If one part breaks, the whole ship doesn't sink."
      },
      {
        "question": "What is a 'cold start' in serverless computing?",
        "answerOptions": [
          {
            "text": "Starting a server in winter",
            "isCorrect": false,
            "rationale": "This is a literal interpretation; cloud terms are metaphorical."
          },
          {
            "text": "Initial delay when provisioning resources for the first request",
            "isCorrect": true,
            "rationale": "Since serverless functions scale to zero, the provider must spin up a new environment when a request finally comes in, causing a delay."
          },
          {
            "text": "Rebooting a crashed function",
            "isCorrect": false,
            "rationale": "While similar, cold start refers to the provisioning from an idle state, not necessarily a crash recovery."
          },
          {
            "text": "Deploying code to production",
            "isCorrect": false,
            "rationale": "Deployment is a CI/CD process; cold start is a runtime latency issue."
          }
        ],
        "hint": "The latency penalty you pay when your function wakes up from sleep."
      },
      {
        "question": "What is a Pod in Kubernetes?",
        "answerOptions": [
          {
            "text": "A cluster of servers",
            "isCorrect": false,
            "rationale": "A cluster is the whole system; a Pod is a small object inside it."
          },
          {
            "text": "The smallest deployable unit, wrapping one or more containers",
            "isCorrect": true,
            "rationale": "Kubernetes doesn't run containers directly; it wraps them in Pods, which share an IP and storage."
          },
          {
            "text": "A network interface",
            "isCorrect": false,
            "rationale": "A Pod uses network interfaces, but it is an application wrapper."
          },
          {
            "text": "A storage volume",
            "isCorrect": false,
            "rationale": "Pods can *use* volumes, but they are compute units."
          }
        ],
        "hint": "Like a pea pod, it can hold one or more 'peas' (containers) inside it."
      },
      {
        "question": "What is the role of the Kubelet?",
        "answerOptions": [
          {
            "text": "Managing the API server",
            "isCorrect": false,
            "rationale": "The API Server manages itself; Kubelet runs on the worker nodes."
          },
          {
            "text": "Storing cluster configuration",
            "isCorrect": false,
            "rationale": "Configuration is stored in etcd."
          },
          {
            "text": "Ensuring containers are running on each node",
            "isCorrect": true,
            "rationale": "Kubelet is the agent on every node that talks to the control plane and ensures the assigned containers are running and healthy."
          },
          {
            "text": "Load balancing traffic",
            "isCorrect": false,
            "rationale": "Kube-proxy handles network rules; Kubelet handles container execution."
          }
        ],
        "hint": "The 'Captain's' agent on every single ship (node) in the fleet."
      },
      {
        "question": "What is the purpose of etcd in Kubernetes?",
        "answerOptions": [
          {
            "text": "Container runtime",
            "isCorrect": false,
            "rationale": "Docker or containerd is the runtime."
          },
          {
            "text": "Distributed key-value store holding cluster state",
            "isCorrect": true,
            "rationale": "etcd is the 'brain' or database of Kubernetes, storing all configuration data and the status of every object."
          },
          {
            "text": "Load balancer",
            "isCorrect": false,
            "rationale": "Load balancing is handled by Services and Ingress."
          },
          {
            "text": "Network proxy",
            "isCorrect": false,
            "rationale": "Kube-proxy handles networking."
          }
        ],
        "hint": "If Kubernetes loses this, it forgets everything about the cluster."
      },
      {
        "question": "Which Kubernetes component is the only one that talks to etcd?",
        "answerOptions": [
          {
            "text": "Kubelet",
            "isCorrect": false,
            "rationale": "Kubelet talks to the API Server, not etcd directly."
          },
          {
            "text": "Kube-Proxy",
            "isCorrect": false,
            "rationale": "Kube-Proxy also talks to the API Server."
          },
          {
            "text": "Kube-API Server",
            "isCorrect": true,
            "rationale": "To maintain consistency and security, only the API Server is allowed to read/write to the database (etcd). All other components talk to the API Server."
          },
          {
            "text": "Scheduler",
            "isCorrect": false,
            "rationale": "The Scheduler asks the API Server for work; it doesn't touch the DB."
          }
        ],
        "hint": "The 'Front Door' of the control plane."
      },
      {
        "question": "What does CI/CD stand for?",
        "answerOptions": [
          {
            "text": "Continuous Integration / Continuous Deployment",
            "isCorrect": true,
            "rationale": "It refers to the automation of integrating code changes and deploying them to environments."
          },
          {
            "text": "Cloud Infrastructure / Cloud Development",
            "isCorrect": false,
            "rationale": "This is a misinterpretation of the acronym."
          },
          {
            "text": "Container Integration / Container Deployment",
            "isCorrect": false,
            "rationale": "While containers are often used, CI/CD applies to any software."
          },
          {
            "text": "Central Intelligence / Central Development",
            "isCorrect": false,
            "rationale": "Unrelated to software engineering."
          }
        ],
        "hint": "The modern pipeline for shipping code."
      },
      {
        "question": "What is the difference between declarative and imperative IaC?",
        "answerOptions": [
          {
            "text": "Declarative specifies steps; imperative specifies desired state",
            "isCorrect": false,
            "rationale": "This is reversed."
          },
          {
            "text": "Declarative specifies desired state; imperative specifies steps",
            "isCorrect": true,
            "rationale": "Declarative (e.g., Terraform) says 'I want 3 servers'. Imperative (e.g., scripts) says 'Create server 1, then create server 2...'."
          },
          {
            "text": "They are the same",
            "isCorrect": false,
            "rationale": "They represent different philosophies of automation."
          },
          {
            "text": "Declarative is only for networks",
            "isCorrect": false,
            "rationale": "Declarative is used for all infrastructure types (compute, storage, etc.)."
          }
        ],
        "hint": "One is like a recipe (do this, then that); the other is like a menu order (I want this result)."
      }
    ]
  },
  {
    "chapter": 6,
    "quiz": [
      {
        "question": "What are Security Groups in cloud computing?",
        "answerOptions": [
          {
            "text": "Physical firewalls",
            "isCorrect": false,
            "rationale": "Security groups are virtual, software-defined constructs, not hardware."
          },
          {
            "text": "Stateful virtual firewalls controlling traffic to cloud resources",
            "isCorrect": true,
            "rationale": "They act as a filter for instances, allowing traffic based on rules. 'Stateful' means they automatically allow return traffic."
          },
          {
            "text": "User access roles",
            "isCorrect": false,
            "rationale": "User access is managed by IAM (Identity and Access Management)."
          },
          {
            "text": "Encryption keys",
            "isCorrect": false,
            "rationale": "Keys are for data protection, not network traffic control."
          }
        ],
        "hint": "The first line of defense for your EC2 instance's network."
      },
      {
        "question": "What does 'stateful' mean for Security Groups?",
        "answerOptions": [
          {
            "text": "They remember previous configurations",
            "isCorrect": false,
            "rationale": "Stateful refers to network connection states, not configuration history."
          },
          {
            "text": "If inbound traffic is allowed, outbound response is automatically permitted",
            "isCorrect": true,
            "rationale": "The firewall tracks the connection state. If you allow a request in, it knows to let the reply out without a separate rule."
          },
          {
            "text": "They require manual configuration",
            "isCorrect": false,
            "rationale": "All firewalls require configuration; this doesn't define 'stateful'."
          },
          {
            "text": "They only work with TCP",
            "isCorrect": false,
            "rationale": "Stateful inspection works with UDP and ICMP as well."
          }
        ],
        "hint": "It has a memory of active connections, so you don't need two rules for one conversation."
      },
      {
        "question": "What is the 'new security perimeter' in cloud computing?",
        "answerOptions": [
          {
            "text": "Network firewalls",
            "isCorrect": false,
            "rationale": "Network firewalls are the *old* perimeter. In the cloud, networks are fluid."
          },
          {
            "text": "Physical data centers",
            "isCorrect": false,
            "rationale": "You don't control the physical center in the cloud."
          },
          {
            "text": "Identity (IAM)",
            "isCorrect": true,
            "rationale": "Since users access cloud resources from anywhere, verifying *who* they are (Identity) is the most critical control point."
          },
          {
            "text": "Encryption keys",
            "isCorrect": false,
            "rationale": "Encryption protects data, but Identity controls access to it."
          }
        ],
        "hint": "It's not about *where* you are (network), but *who* you are."
      },
      {
        "question": "What is the difference between data residency and data sovereignty?",
        "answerOptions": [
          {
            "text": "They are the same",
            "isCorrect": false,
            "rationale": "They are distinct concepts regarding location vs. law."
          },
          {
            "text": "Residency is physical location; sovereignty is legal jurisdiction",
            "isCorrect": true,
            "rationale": "Residency is just geography (e.g., 'Server is in France'). Sovereignty is about which country's laws apply to that data."
          },
          {
            "text": "Residency is legal; sovereignty is physical",
            "isCorrect": false,
            "rationale": "This is swapped."
          },
          {
            "text": "Residency only applies to backups",
            "isCorrect": false,
            "rationale": "Residency applies to all data."
          }
        ],
        "hint": "One is GPS coordinates; the other is the gavel of the law."
      },
      {
        "question": "What is envelope encryption?",
        "answerOptions": [
          {
            "text": "Encrypting emails",
            "isCorrect": false,
            "rationale": "While the name sounds like email, it's a general cryptographic technique."
          },
          {
            "text": "Using a Key Encryption Key (KEK) to encrypt the Data Encryption Key (DEK)",
            "isCorrect": true,
            "rationale": "You encrypt the data with a key (DEK), then you encrypt *that* key with a master key (KEK). It's a key inside a key."
          },
          {
            "text": "Physical security for keys",
            "isCorrect": false,
            "rationale": "It's a digital algorithm, not a physical envelope."
          },
          {
            "text": "Encrypting only metadata",
            "isCorrect": false,
            "rationale": "Envelope encryption protects the actual data keys, and by extension, the data."
          }
        ],
        "hint": "Putting the key inside a locked box."
      },
      {
        "question": "Under GDPR, what is the maximum penalty for non-compliance?",
        "answerOptions": [
            {
                "text": "€1 million",
                "isCorrect": false,
                "rationale": "This is far too low for major corporations."
            },
            {
                "text": "€10 million or 2% of global revenue",
                "isCorrect": false,
                "rationale": "This is the penalty for less severe infringements."
            },
            {
                "text": "€20 million or 4% of global revenue",
                "isCorrect": true,
                "rationale": "For severe violations, the fine is the higher of €20M or 4% of total worldwide annual turnover."
            },
            {
                "text": "€50 million",
                "isCorrect": false,
                "rationale": "While fines can be high, the specific statutory cap is defined by the 20M/4% rule."
            }
        ],
        "hint": "It's a huge number designed to scare even tech giants—think 4%."
      }
    ]
  }
]